# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [2]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  0.863186  0.690582 -0.928436 -0.703250
B -0.464716 -0.128152  0.433186  0.402609
C -1.516665  0.001227 -0.706810 -0.835178
D  0.659146  0.617377  0.755444 -1.309614
E  0.770870 -0.994594 -0.711444  2.014450

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [6]:
df['W']

A    0.863186
B   -0.464716
C   -1.516665
D    0.659146
E    0.770870
Name: W, dtype: float64

In [7]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.863186 -0.703250
B -0.464716  0.402609
C -1.516665 -0.835178
D  0.659146 -1.309614
E  0.770870  2.014450

In [8]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.863186
B   -0.464716
C   -1.516665
D    0.659146
E    0.770870
Name: W, dtype: float64

DataFrame Columns are just Series

In [9]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [10]:
df['new'] = df['W'] + df['Y']

In [11]:
df

          W         X         Y         Z       new
A  0.863186  0.690582 -0.928436 -0.703250 -0.065250
B -0.464716 -0.128152  0.433186  0.402609 -0.031530
C -1.516665  0.001227 -0.706810 -0.835178 -2.223476
D  0.659146  0.617377  0.755444 -1.309614  1.414590
E  0.770870 -0.994594 -0.711444  2.014450  0.059426

** Removing Columns**

In [12]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.863186  0.690582 -0.928436 -0.703250
B -0.464716 -0.128152  0.433186  0.402609
C -1.516665  0.001227 -0.706810 -0.835178
D  0.659146  0.617377  0.755444 -1.309614
E  0.770870 -0.994594 -0.711444  2.014450

In [13]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.863186  0.690582 -0.928436 -0.703250 -0.065250
B -0.464716 -0.128152  0.433186  0.402609 -0.031530
C -1.516665  0.001227 -0.706810 -0.835178 -2.223476
D  0.659146  0.617377  0.755444 -1.309614  1.414590
E  0.770870 -0.994594 -0.711444  2.014450  0.059426

In [14]:
df.drop('new',axis=1,inplace=True)

In [15]:
df

          W         X         Y         Z
A  0.863186  0.690582 -0.928436 -0.703250
B -0.464716 -0.128152  0.433186  0.402609
C -1.516665  0.001227 -0.706810 -0.835178
D  0.659146  0.617377  0.755444 -1.309614
E  0.770870 -0.994594 -0.711444  2.014450

Can also drop rows this way:

In [16]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.863186  0.690582 -0.928436 -0.703250
B -0.464716 -0.128152  0.433186  0.402609
C -1.516665  0.001227 -0.706810 -0.835178
D  0.659146  0.617377  0.755444 -1.309614

** Selecting Rows**

In [17]:
df.loc['A']

W    0.863186
X    0.690582
Y   -0.928436
Z   -0.703250
Name: A, dtype: float64

Or select based off of position instead of label

In [18]:
df.iloc[2]

W   -1.516665
X    0.001227
Y   -0.706810
Z   -0.835178
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [19]:
df.loc['B','Y']

0.43318620656184537

In [20]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.863186 -0.928436
B -0.464716  0.433186

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [21]:
df

          W         X         Y         Z
A  0.863186  0.690582 -0.928436 -0.703250
B -0.464716 -0.128152  0.433186  0.402609
C -1.516665  0.001227 -0.706810 -0.835178
D  0.659146  0.617377  0.755444 -1.309614
E  0.770870 -0.994594 -0.711444  2.014450

In [22]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False  False   True   True
C  False   True  False  False
D   True   True   True  False
E   True  False  False   True

In [23]:
df[df>0]

          W         X         Y         Z
A  0.863186  0.690582       NaN       NaN
B       NaN       NaN  0.433186  0.402609
C       NaN  0.001227       NaN       NaN
D  0.659146  0.617377  0.755444       NaN
E  0.770870       NaN       NaN  2.014450

In [24]:
df[df['W']>0]

          W         X         Y         Z
A  0.863186  0.690582 -0.928436 -0.703250
D  0.659146  0.617377  0.755444 -1.309614
E  0.770870 -0.994594 -0.711444  2.014450

In [25]:
df[df['W']>0]['Y']

A   -0.928436
D    0.755444
E   -0.711444
Name: Y, dtype: float64

In [26]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.928436  0.690582
D  0.755444  0.617377
E -0.711444 -0.994594

For two conditions you can use | and & with parenthesis:

In [27]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [28]:
df

          W         X         Y         Z
A  0.863186  0.690582 -0.928436 -0.703250
B -0.464716 -0.128152  0.433186  0.402609
C -1.516665  0.001227 -0.706810 -0.835178
D  0.659146  0.617377  0.755444 -1.309614
E  0.770870 -0.994594 -0.711444  2.014450

In [29]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.863186  0.690582 -0.928436 -0.703250
1     B -0.464716 -0.128152  0.433186  0.402609
2     C -1.516665  0.001227 -0.706810 -0.835178
3     D  0.659146  0.617377  0.755444 -1.309614
4     E  0.770870 -0.994594 -0.711444  2.014450

In [30]:
newind = 'CA NY WY OR CO'.split()

In [31]:
df['States'] = newind

In [32]:
df

          W         X         Y         Z States
A  0.863186  0.690582 -0.928436 -0.703250     CA
B -0.464716 -0.128152  0.433186  0.402609     NY
C -1.516665  0.001227 -0.706810 -0.835178     WY
D  0.659146  0.617377  0.755444 -1.309614     OR
E  0.770870 -0.994594 -0.711444  2.014450     CO

In [33]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.863186  0.690582 -0.928436 -0.703250
NY     -0.464716 -0.128152  0.433186  0.402609
WY     -1.516665  0.001227 -0.706810 -0.835178
OR      0.659146  0.617377  0.755444 -1.309614
CO      0.770870 -0.994594 -0.711444  2.014450

In [34]:
df

          W         X         Y         Z States
A  0.863186  0.690582 -0.928436 -0.703250     CA
B -0.464716 -0.128152  0.433186  0.402609     NY
C -1.516665  0.001227 -0.706810 -0.835178     WY
D  0.659146  0.617377  0.755444 -1.309614     OR
E  0.770870 -0.994594 -0.711444  2.014450     CO

In [35]:
df.set_index('States',inplace=True)

In [36]:
df

               W         X         Y         Z
States
CA      0.863186  0.690582 -0.928436 -0.703250
NY     -0.464716 -0.128152  0.433186  0.402609
WY     -1.516665  0.001227 -0.706810 -0.835178
OR      0.659146  0.617377  0.755444 -1.309614
CO      0.770870 -0.994594 -0.711444  2.014450

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [37]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [38]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [39]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.554350 -1.060944
   2  0.088617  1.248904
   3 -0.653700 -0.679495
G2 1 -0.098526  0.634653
   2  0.950006  0.562448
   3 -0.132789 -0.248175

In [40]:
df.loc['G1']

          A         B
1 -1.554350 -1.060944
2  0.088617  1.248904
3 -0.653700 -0.679495

In [41]:
df.loc['G1'].loc[1]

A   -1.554350
B   -1.060944
Name: 1, dtype: float64

In [42]:
df.index.names

FrozenList([None, None])

In [43]:
df.index.names = ['Group','Num']

In [44]:
df

                  A         B
Group Num
G1    1   -1.554350 -1.060944
      2    0.088617  1.248904
      3   -0.653700 -0.679495
G2    1   -0.098526  0.634653
      2    0.950006  0.562448
      3   -0.132789 -0.248175

In [45]:
df.xs('G1')

            A         B
Num
1   -1.554350 -1.060944
2    0.088617  1.248904
3   -0.653700 -0.679495

In [46]:
df.xs(['G1',1])

A   -1.554350
B   -1.060944
Name: (G1, 1), dtype: float64

In [47]:
df.xs(1,level='Num')

              A         B
Group
G1    -1.554350 -1.060944
G2    -0.098526  0.634653